#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.folders.google_folder.business_units["finance"] will be created
  + resource "google_folder" "business_units" {
      + create_time     = (known after apply)
      + display_name    = "finance"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/684922988114"
    }

  # module.folders.google_folder.business_units["it-services"] will be created
  + resource "google_folder" "business_units" {
      + create_time     = (known after apply)
      + display_name    = "it-services"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/684922988114"
    }

  # module.folders.google_folder.business_units["marketing"] will be created
  + resource "google_folder" "business_units" {
      + create_time     = (known after apply)
      + display_name    = "marketing"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/684922988114"
    }

  # module.folders.google_folder.cos_folders["it-services.cloud"] will be created
  + resource "google_folder" "cos_folders" {
      + create_time     = (known after apply)
      + display_name    = "cloud"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.folders.google_folder.cos_folders["it-services.datascience"] will be created
  + resource "google_folder" "cos_folders" {
      + create_time     = (known after apply)
      + display_name    = "datascience"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.folders.google_folder.cos_folders["it-services.devops"] will be created
  + resource "google_folder" "cos_folders" {
      + create_time     = (known after apply)
      + display_name    = "devops"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.folders.google_folder.cos_folders["it-services.engineering"] will be created
  + resource "google_folder" "cos_folders" {
      + create_time     = (known after apply)
      + display_name    = "engineering"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jithinpnjm, Action: `pull_request`, Working Directory: ``, Workflow: `gcp_bootstrap_dev`*